# ДЗ

### **Відловлюємо некоректні символи в списку чисел**

"""**Назва**
    
    Відловлюємо некоректні символи в списку чисел
    
**Опис ДЗ**

    
    Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
    
    ["1,2,3,4",
    "1,2,3,4,50"
    "qwerty1,2,3"]
    
    Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
    
    Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
    
    Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
    
    Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”
    
**Складність**
    
    Середня
    

# Як робити домашне завдання у Git

## 0. ОБОВ’ЯЗКОВО створити нову гілку

1. **Виконати ДЗ у окремій папці homework_<#lesson>.py**
2. **Закомітити створений код**
3. **Створити ПУЛ-РЕКВЕСТ у власний репозиторій У ГІЛКУ main**    
4. **Назначити ревьювером викладача**
5. **Посилання на PR вставити у форму відповіді**
"""
print("\n Task")
def calculate_sum(s):
  try:
      elements = s.replace(' ', '').split(',')
      numbers = [int(element) for element in elements]
      return sum(numbers)
  except ValueError:
      """" Якщо є елементи, що не можна перетворити на число, ловимо виключення"""
      return "I can't do it!"

def process_list(lst):
  results = []
  for item in lst:
      result = calculate_sum(item)
      results.append(result)
  return results

strings = ["1,2,3,4", 
           "1,2,3,4,50", 
           "qwerty1,2,3", 
           "1, 2, 2"]
output = process_list(strings)
print(output) 



