# task 1
"""  Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо так, надрукуйте повідомлення про те, що гравець щойно заробив 5 балів.
"""
alien_color = ['green', 'yellow', 'red']
if alien_color == 'green':
    print('Ви щойно заробили 5 балів!')
else:
    print('Колір прибульця не зелений!')
# task 2
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою else.
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Зробіть так, щоб виводилася умова else.
"""

alien_color = "red"
if alien_color == 'green':
    print('Ви щойно заробили 5 балів!')
else:
    print('Ви щойно заробили 10 балів!')

# task 3

alien_color = ['green', 'yellow', 'red']
for color in alien_color:
    if color == 'green':
        print('Ви щойно заробили 5 балів!')
    elif color == 'red':
        print('Ви щойно заробили 15 очок')
    else:
        print('Ви щойно заробили 10 балів!')

# task 4

"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою elif.
змінну під назвою alien_color перетворіть у список значень: 'green', 'yellow', 'red'
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Якщо прибулець червоний, надрукуйте повідомлення про те, що гравець заробив 15 очок
+ напишіть цикл for що перебере і обробить всі значення списку alien_color
"""
# Написав в задачі task 3

# task 5
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""

pizza_topping = []

while True:
    item = input("Введіть начинку (або 'quit' для завершення): ")
    if item == 'quit':
        break
    pizza_topping.append(item)
    print(f'Ми додамо {item} до вашої піци. Щось ще бажаєте?')

print('Давайте перевіримо! Ваші начинки до піци ->', pizza_topping)

# task 6
"""  Напишіть програму, яка знаходить суму всіх цифр цілого числа, яке вводить користувач.
Для перебору вводу від користувача використовуйте цикл. Виведіть суму цифр числа на екран.
Приклад виконання програми:
Введіть число: 12345
Сума цифр числа 12345: 15
"""

number = input("Введіть число: ")

sum_of_digits = 0

for digit in number:
    sum_of_digits += int(digit)

print(f'Сума цифр числа {number}: {sum_of_digits}')

# task 7
"""  Потрібно написати програму, яка просить користувача ввести числа, доки він не введе 0.
Програма повинна підрахувати суму всіх введених чисел, окрім 0, і вивести її на екран.
Це повинно працювать як калькулятор, в який ввів цифру - нажав плюс - ввів наступну цифру.
Після введеня 0 показує результат сумування.
Розв'язати з використанням циклу while та break
"""

sum_of_digits = 0
while True:
    number = input('Введіть число(або 0 для завершення): ')
    number = int(number)
    if number == 0:
        break
    else:
        sum_of_digits += number

print(f'Ваш результат сумування = {sum_of_digits}')


# task 8
"""  З використанням циклу for реалізуйте гру "Вгадай число".
Початок програми написаний, гравець має 5 спроб відгадати випадкове число від 1 до 20,
яке було згенеровано за допомогою функції randint() модуля random.
У кожній спробі гравець вводить своє припущення, після чого програма повідомляє, чи
було припущення занадто великим або занадто малим, чи гравець вгадав число.
"""

import random
secret_number = random.randint(1, 20)
guesses = 0
max_guesses = 5
print("Вгадайте число від 1 до 20 за 5 спроб!")

for guesses in range(1, max_guesses + 1):
    users_digit = int(input('Напишіть число: '))

    if users_digit == secret_number:
        print('Вітаємо! Ви вгадали число!')
        break
    elif users_digit < secret_number:
        print('Ваше число занадто мале')
    else:
        print('Ваше число занадто велике')

    if guesses == max_guesses:
        print(f'К-сть спроб вичерпана! Ви не вгадали число, це було {secret_number}. Спробуйте іншого разу!')

# task 9
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""

fruits = ["apple", "banana", "orange", "grape", "mango"]
fruit_without_orange = []
for fruit in fruits:
    if fruit == 'orange':
        continue
    else:
        fruit_without_orange.append(fruit)
print(fruit_without_orange)

# task 10
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
"""
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [num * num for num in numbers if num % 2 == 0]
print(result)  #  [4, 16, 36, 64, 100]
